src/cf/src/DataProcessors/ТестыДокументов/ТестыДокументов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:DataProcessor>
  <name>ТестыДокументов</name>
  <comment>Технологическая обработка подсистемы «Автотесты», уровень 3: сценарии жизненного цикла документов (создание, запись, проведение, движения по регистрам), каждый в транзакции с откатом. Запускается параметром /C "ТестыДокументов;путь-к-отчёту", см. docs/TESTING.md.</comment>
</mdclass:DataProcessor>

src/cf/src/InformationRegisters/ДополнительныеСведения/ДополнительныеСведения.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ДополнительныеСведения</name>
  <comment>Значения дополнительных сведений (реквизиты с флагом ЭтоСведение) по объектам; пишет УправлениеСвойствами</comment>
  <resources>
    <name>Значение</name>
    <type>
      <types>Characteristic.ДополнительныеРеквизиты</types>
    </type>
  </resources>
  <dimensions>
    <name>Объект</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Свойство</name>
    <type>
      <types>ChartOfCharacteristicTypesRef.ДополнительныеРеквизиты</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

src/cf/src/AccumulationRegisters/ТоварыВНаличии/ТоварыВНаличии.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>ТоварыВНаличии</name>
  <resources>
    <name>Количество</name>
    <type>
      <types>DefinedType.Количество</types>
    </type>
  </resources>
  <resources>
    <name>Сумма</name>
    <type>
      <types>DefinedType.Сумма</types>
    </type>
  </resources>
  <resources>
    <name>СуммаНДС</name>
    <type>
      <types>DefinedType.Сумма</types>
    </type>
  </resources>
  <attributes>
    <name>Комплект</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </attributes>
  <dimensions>
    <name>МестоХранения</name>
    <type>
      <types>CatalogRef.МестаХранения</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Номенклатура</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Характеристика</name>
    <type>
      <types>CatalogRef.ХарактеристикиНоменклатуры</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Серия</name>
    <type>
      <types>CatalogRef.СерииНоменклатуры</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Партия</name>
    <type>
      <types>DefinedType.ПриходныйДокументПартии</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ДатаПартии</name>
    <comment>Реквизит для ускорения выборки по FIFO</comment>
    <type>
      <types>Date</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

src/cf/src/AccumulationRegisters/ТоварыВПереработке/ТоварыВПереработке.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>ТоварыВПереработке</name>
  <resources>
    <name>Количество</name>
    <type>
      <types>DefinedType.Количество</types>
    </type>
  </resources>
  <resources>
    <name>Сумма</name>
    <type>
      <types>DefinedType.Сумма</types>
    </type>
  </resources>
  <resources>
    <name>СуммаНДС</name>
    <type>
      <types>DefinedType.Сумма</types>
    </type>
  </resources>
  <dimensions>
    <name>Контрагент</name>
    <comment>Переработчик, у которого находятся товары</comment>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Номенклатура</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Характеристика</name>
    <type>
      <types>CatalogRef.ХарактеристикиНоменклатуры</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Серия</name>
    <type>
      <types>CatalogRef.СерииНоменклатуры</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Партия</name>
    <type>
      <types>DefinedType.ПриходныйДокументПартии</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ДатаПартии</name>
    <comment>Реквизит для ускорения выборки по FIFO</comment>
    <type>
      <types>Date</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ПередачаВПереработку</name>
    <type>
      <types>DocumentRef.ПередачаВПереработку</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ЗаказПокупателя</name>
    <type>
      <types>DocumentRef.ЗаказПокупателя</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

src/cf/src/AccumulationRegisters/ДенежныеСредстваОрганизаций/ДенежныеСредстваОрганизаций.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>ДенежныеСредстваОрганизаций</name>
  <resources>
    <name>Сумма</name>
    <type>
      <types>DefinedType.Сумма</types>
    </type>
  </resources>
  <resources>
    <name>СуммаУчет</name>
    <type>
      <types>DefinedType.Сумма</types>
    </type>
  </resources>
  <resources>
    <name>СуммаВВалюте</name>
    <type>
      <types>DefinedType.Сумма</types>
    </type>
  </resources>
  <attributes>
    <name>Накладная</name>
    <type>
      <types>DocumentRef.ПрочиеРасходы</types>
      <types>DocumentRef.РеализацияТоваровУслуг</types>
      <types>DocumentRef.НалоговаяНакладная</types>
      <types>DocumentRef.ПоступлениеТоваровУслуг</types>
      <types>DocumentRef.НалоговаяНакладнаяПокупка</types>
    </type>
  </attributes>
  <attributes>
    <name>ДокументДвижения</name>
    <type>
      <types>DocumentRef.СписаниеБезналичныхДенежныхСредств</types>
      <types>DocumentRef.РасходныйКассовыйОрдер</types>
      <types>DocumentRef.ПоступлениеБезналичныхДенежныхСредств</types>
      <types>DocumentRef.ПриходныйКассовыйОрдер</types>
      <types>DocumentRef.НалоговаяНакладная</types>
      <types>DocumentRef.НалоговаяНакладнаяПокупка</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаДвижения</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ДокументОснование</name>
    <type>
      <types>DocumentRef.РеализацияТоваровУслуг</types>
      <types>DocumentRef.НалоговаяНакладная</types>
      <types>DocumentRef.ПоступлениеТоваровУслуг</types>
      <types>DocumentRef.НалоговаяНакладнаяПокупка</types>
    </type>
  </attributes>
  <dimensions>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </dimensions>
  <dimensions>
    <name>МестоХранения</name>
    <type>
      <types>CatalogRef.БанковскиеСчета</types>
      <types>CatalogRef.Кассы</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ТипДенежныхСредств</name>
    <type>
      <types>CatalogRef.TypesDePayment</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

src/cf/src/AccumulationRegisters/Продажи/Продажи.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>Продажи</name>
  <registerType>Turnovers</registerType>
  <resources>
    <name>Количество</name>
    <type>
      <types>DefinedType.Количество</types>
    </type>
  </resources>
  <resources>
    <name>Себестоимость</name>
    <type>
      <types>DefinedType.Сумма</types>
    </type>
  </resources>
  <resources>
    <name>ДополнительныеРасходы</name>
    <type>
      <types>DefinedType.Сумма</types>
    </type>
  </resources>
  <resources>
    <name>Выручка</name>
    <type>
      <types>DefinedType.Сумма</types>
    </type>
  </resources>
  <resources>
    <name>НДС</name>
    <type>
      <types>DefinedType.Сумма</types>
    </type>
  </resources>
  <resources>
    <name>ВаловаяПрибыль</name>
    <type>
      <types>DefinedType.Сумма</types>
    </type>
  </resources>
  <dimensions>
    <name>ХозяйственнаяОперация</name>
    <type>
      <types>EnumRef.ХозяйственныеОперации</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Сотрудник</name>
    <type>
      <types>CatalogRef.ФизическиеЛица</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Контрагент</name>
    <type>
      <types>CatalogRef.ФизическиеЛица</types>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ДокументПродажи</name>
    <type>
      <types>DocumentRef.РеализацияТоваровУслуг</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Партия</name>
    <type>
      <types>DefinedType.ПриходныйДокументПартии</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Номенклатура</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Характеристика</name>
    <type>
      <types>CatalogRef.ХарактеристикиНоменклатуры</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </dimensions>
  <dimensions>
    <name>МестоХранения</name>
    <type>
      <types>CatalogRef.МестаХранения</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

src/cf/src/AccumulationRegisters/Зарплата/Зарплата.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>Зарплата</name>
  <resources>
    <name>Сумма</name>
    <type>
      <types>DefinedType.Сумма</types>
    </type>
  </resources>
  <attributes>
    <name>СтатьяЗатрат</name>
    <type>
      <types>CatalogRef.СтатьиДвиженияДенежныхСредств</types>
    </type>
  </attributes>
  <dimensions>
    <name>Сотрудник</name>
    <type>
      <types>CatalogRef.ФизическиеЛица</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

src/cf/src/Enums/ХозяйственныеОперации/ХозяйственныеОперации.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ХозяйственныеОперации</name>
  <enumValues>
    <name>АвансКлиента</name>
  </enumValues>
  <enumValues>
    <name>ВозвратДенежныхСредствОтПоставщика</name>
  </enumValues>
  <enumValues>
    <name>ВозвратОплатыКлиенту</name>
  </enumValues>
  <enumValues>
    <name>ВозвратТоваровОтКлиента</name>
  </enumValues>
  <enumValues>
    <name>ВозвратТоваровПоставщику</name>
  </enumValues>
  <enumValues>
    <name>ВыдачаДенежныхСредствВКассу</name>
  </enumValues>
  <enumValues>
    <name>ВыплатаЗарплаты</name>
  </enumValues>
  <enumValues>
    <name>ЗакупкаУПоставщика</name>
  </enumValues>
  <enumValues>
    <name>КомплектацияНоменклатуры</name>
  </enumValues>
  <enumValues>
    <name>ОплатаПоставщику</name>
  </enumValues>
  <enumValues>
    <name>ПеремещениеОприходование</name>
  </enumValues>
  <enumValues>
    <name>ПеремещениеСписание</name>
  </enumValues>
  <enumValues>
    <name>ПеречислениеДенежныхСредствНаБанковскийСчет</name>
  </enumValues>
  <enumValues>
    <name>ПеречислениеНалоговИВзносов</name>
  </enumValues>
  <enumValues>
    <name>ПланируемыеЦеныЗакупки</name>
  </enumValues>
  <enumValues>
    <name>ПоступлениеДенежныхСредствИзКассы</name>
  </enumValues>
  <enumValues>
    <name>ПоступлениеДенежныхСредствСБанковскогоСчета</name>
  </enumValues>
  <enumValues>
    <name>ПоступлениеОплатыОтКлиента</name>
  </enumValues>
  <enumValues>
    <name>ПродажаВКредит</name>
  </enumValues>
  <enumValues>
    <name>ПрочееПоступлениеДенежныхСредств</name>
  </enumValues>
  <enumValues>
    <name>ПрочийРасходДенежныхСредств</name>
  </enumValues>
  <enumValues>
    <name>РазукомплектацияНоменклатуры</name>
  </enumValues>
  <enumValues>
    <name>РеализацияКлиенту</name>
  </enumValues>
  <enumValues>
    <name>Сертификат</name>
  </enumValues>
  <enumValues>
    <name>СнятиеНаличныхДенежныхСредств</name>
  </enumValues>
  <enumValues>
    <name>СписаниеЗадолженности</name>
  </enumValues>
  <enumValues>
    <name>УстановкаЦенНоменклатуры</name>
  </enumValues>
  <enumValues>
    <name>ОбналичиваниеЧека</name>
  </enumValues>
  <enumValues>
    <name>ОперационныеЗатраты</name>
  </enumValues>
  <enumValues>
    <name>Прочее</name>
  </enumValues>
  <enumValues>
    <name>Инкассация</name>
  </enumValues>
</mdclass:Enum>

src/cf/src/Enums/Отрасли/Отрасли.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>Отрасли</name>
  <enumValues>
    <name>Торговля</name>
  </enumValues>
  <enumValues>
    <name>Строительство</name>
  </enumValues>
  <enumValues>
    <name>Прочее</name>
  </enumValues>
  <enumValues>
    <name>Ткани</name>
  </enumValues>
</mdclass:Enum>

src/cf/src/Enums/ТипыНоменклатуры/ТипыНоменклатуры.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ТипыНоменклатуры</name>
  <enumValues>
    <name>Товар</name>
  </enumValues>
  <enumValues>
    <name>Услуга</name>
  </enumValues>
  <enumValues>
    <name>Продукция</name>
  </enumValues>
  <enumValues>
    <name>Полуфабрикат</name>
  </enumValues>
  <enumValues>
    <name>Сырье</name>
  </enumValues>
</mdclass:Enum>

src/cf/src/DataProcessors/ТестыДокументов/ManagerModule.bsl
////////////////////////////////////////////////////////////////////////////////
// Серверная часть автотестов уровня 3: жизненный цикл документов.
// Каждый сценарий сам заводит нужные ему данные (контрагент, склад, номенклатура,
// касса, счёт), создаёт, записывает и проводит документы и сверяет движения по
// регистрам. Сценарий выполняется в транзакции, которая всегда откатывается -
// после прогона база не меняется, поэтому его можно гонять и на копии базы клиента.
// Модуль формы обработки только запускает прогон и пишет отчёт.
// Регламент, состав сценариев и разбор ошибок - docs/TESTING.md.
////////////////////////////////////////////////////////////////////////////////

#Область ПрограммныйИнтерфейс

// Имена сценариев прогона в порядке выполнения. Новый документооборот - новый
// сценарий: имя сюда, ветка в СценарийПоИмени, описание в docs/TESTING.md и docs/TESTS.xlsx.
//
// Возвращаемое значение:
//  Массив из Строка - имена сценариев
//
Функция ИменаСценариев() Экспорт

	Имена = Новый Массив;
	Имена.Добавить("Закупка");
	Имена.Добавить("Продажа");
	Имена.Добавить("ВозвратОтПокупателя");
	Имена.Добавить("ВыпускПродукции");
	Имена.Добавить("Переработка");
	Имена.Добавить("Зарплата");
	Имена.Добавить("БезналичныеДеньги");
	Имена.Добавить("ДополнительныеРеквизиты");
	Имена.Добавить("Отрасль");
	Имена.Добавить("НастройкиПрограммы");
	Возврат Имена;

КонецФункции

// Выполняет все сценарии, каждый в своей транзакции с откатом.
//
// Возвращаемое значение:
//  Структура - итог прогона:
//   * Строки    - Массив из Строка - строки отчёта видов ОК, ОШИБКА, ПРОПУСК
//   * Сценариев - Число           - сколько сценариев выполнялось
//   * Ошибок    - Число           - сколько из них упало
//   * Пропущено - Число           - сколько пропущено (нет условий для проверки)
//
Функция ВыполнитьСценарии() Экспорт

	Итог = Новый Структура;
	Итог.Вставить("Строки", Новый Массив);
	Итог.Вставить("Сценариев", 0);
	Итог.Вставить("Ошибок", 0);
	Итог.Вставить("Пропущено", 0);

	Для Каждого Имя Из ИменаСценариев() Цикл
		ВыполнитьСценарий(Имя, Итог);
	КонецЦикла;

	Возврат Итог;

КонецФункции

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

#Область Прогон

// Один сценарий в транзакции. Откат делается в обеих ветках: сценарий проверяет
// поведение, а не оставляет данные, и после исключения внутри вложенной записи
// транзакция всё равно годится только для отката.
//
// Параметры:
//  Имя  - Строка    - имя сценария из ИменаСценариев
//  Итог - Структура - см. ВыполнитьСценарии
//
Процедура ВыполнитьСценарий(Имя, Итог)

	Итог.Сценариев = Итог.Сценариев + 1;
	// Чужие сообщения в очереди не должны попасть в описание ошибки сценария.
	ПолучитьСообщенияПользователю(Истина);

	// Фиксации нет намеренно: данные сценария живут только внутри его транзакции.
	// BSLLS:PairingBrokenTransaction-off
	// BSLLS:WrongUseOfRollbackTransactionMethod-off
	НачатьТранзакцию();
	Попытка
		Результат = СценарийПоИмени(Имя);
		ОтменитьТранзакцию();
	Исключение
		ОтменитьТранзакцию();
		// BSLLS:WrongUseOfRollbackTransactionMethod-on
		// BSLLS:PairingBrokenTransaction-on
		Информация = ИнформацияОбОшибке();
		Итог.Строки.Добавить("ОШИБКА;" + Имя + ";" + ОшибкаОднойСтрокой(Информация) + СообщенияПользователю());
		Итог.Ошибок = Итог.Ошибок + 1;
		Возврат;
	КонецПопытки;

	Если Результат.Пропуск Тогда
		Итог.Строки.Добавить("ПРОПУСК;" + Имя + ";" + Результат.Текст);
		Итог.Пропущено = Итог.Пропущено + 1;
	Иначе
		Итог.Строки.Добавить("ОК;" + Имя + ";" + Результат.Текст);
	КонецЕсли;

КонецПроцедуры

// Диспетчер сценариев: имя - ветка. Контекст с данными заводится заново для каждого
// сценария внутри его транзакции.
//
// Параметры:
//  Имя - Строка - имя сценария
//
// Возвращаемое значение:
//  Структура - см. РезультатСценария
//
Функция СценарийПоИмени(Имя)

	Контекст = НовыйКонтекст();

	Если Имя = "Закупка" Тогда
		Результат = СценарийЗакупка(Контекст);
	ИначеЕсли Имя = "Продажа" Тогда
		Результат = СценарийПродажа(Контекст);
	ИначеЕсли Имя = "ВозвратОтПокупателя" Тогда
		Результат = СценарийВозвратОтПокупателя(Контекст);
	ИначеЕсли Имя = "ВыпускПродукции" Тогда
		Результат = СценарийВыпускПродукции(Контекст);
	ИначеЕсли Имя = "Переработка" Тогда
		Результат = СценарийПереработка(Контекст);
	ИначеЕсли Имя = "Зарплата" Тогда
		Результат = СценарийЗарплата(Контекст);
	ИначеЕсли Имя = "БезналичныеДеньги" Тогда
		Результат = СценарийБезналичныеДеньги(Контекст);
	ИначеЕсли Имя = "ДополнительныеРеквизиты" Тогда
		Результат = СценарийДополнительныеРеквизиты(Контекст);
	ИначеЕсли Имя = "Отрасль" Тогда
		Результат = СценарийОтрасль();
	ИначеЕсли Имя = "НастройкиПрограммы" Тогда
		Результат = СценарийНастройкиПрограммы();
	Иначе
		ВызватьИсключение "Сценарий " + Имя + " не описан в СценарийПоИмени";
	КонецЕсли;

	Возврат Результат;

КонецФункции

// Результат сценария для отчёта.
//
// Параметры:
//  Текст   - Строка - что проверено (ОК) или почему пропущено (ПРОПУСК)
//  Пропуск - Булево - сценарий пропущен: в базе нет условий для проверки
//
// Возвращаемое значение:
//  Структура - Текст, Пропуск
//
Функция РезультатСценария(Текст, Пропуск = Ложь)

	Возврат Новый Структура("Текст, Пропуск", Текст, Пропуск);

КонецФункции

#КонецОбласти

#Область Сценарии

// Закупка: поступление товара даёт остаток на складе и долг перед поставщиком.
//
// Параметры:
//  Контекст - Структура - см. НовыйКонтекст
//
// Возвращаемое значение:
//  Структура - см. РезультатСценария
//
Функция СценарийЗакупка(Контекст)

	Числа = Контекст.Числа;
	Поступление = ДокументЗакупки(Контекст, Контекст.Товар, Числа.КоличествоЗакупки, Числа.ЦенаЗакупки);
	СуммаЗакупки = Числа.КоличествоЗакупки * Числа.ЦенаЗакупки;

	Остаток = ОстатокТовара(Контекст.Склад, Контекст.Товар);
	ПроверитьРавенство(Числа.КоличествоЗакупки, Остаток.Количество, "остаток товара после закупки");
	ПроверитьРавенство(СуммаЗакупки, Остаток.Сумма, "себестоимость остатка после закупки");
	ПроверитьДолгПоставщику(Поступление, СуммаЗакупки, "долг поставщику по поступлению");

	Текст = "остаток " + СтрокаЧисла(Остаток.Количество) + " на " + СтрокаЧисла(Остаток.Сумма)
		+ "; долг поставщику " + СтрокаЧисла(СуммаЗакупки);
	Возврат РезультатСценария(Текст);

КонецФункции

// Продажа: заказ покупателя, реализация по заказу, оплата в кассу. Проверяются остаток,
// регистр продаж (выручка и себестоимость) и закрытие долга покупателя.
//
// Параметры:
//  Контекст - Структура - см. НовыйКонтекст
//
// Возвращаемое значение:
//  Структура - см. РезультатСценария
//
Функция СценарийПродажа(Контекст)

	Числа = Контекст.Числа;
	ДокументЗакупки(Контекст, Контекст.Товар, Числа.КоличествоЗакупки, Числа.ЦенаЗакупки);

	Заказ = ДокументЗаказаПокупателя(Контекст, Контекст.Товар, Числа.КоличествоПродажи, Числа.ЦенаПродажи);
	Реализация = ДокументРеализацииПоЗаказу(Контекст, Заказ);
	СуммаПродажи = Числа.КоличествоПродажи * Числа.ЦенаПродажи;
	Себестоимость = Числа.КоличествоПродажи * Числа.ЦенаЗакупки;

	ПроверитьРавенство(Заказ, Реализация.Основание, "основание реализации");
	ПроверитьРавенство(СуммаПродажи, Реализация.Сумма, "сумма реализации");

	Остаток = ОстатокТовара(Контекст.Склад, Контекст.Товар);
	ПроверитьРавенство(Числа.КоличествоЗакупки - Числа.КоличествоПродажи, Остаток.Количество, "остаток товара после продажи");

	Продажи = ОборотыПродаж(Реализация);
	ПроверитьРавенство(Числа.КоличествоПродажи, Продажи.Количество, "количество в регистре продаж");
	ПроверитьРавенство(СуммаПродажи, Продажи.Выручка, "выручка в регистре продаж");
	ПроверитьРавенство(Себестоимость, Продажи.Себестоимость, "себестоимость в регистре продаж");
	ПроверитьДолгПокупателя(Реализация, СуммаПродажи, "долг покупателя по реализации");

	Оплата = ДокументОплатыВКассу(Контекст, Реализация, СуммаПродажи);
	ПроверитьДолгПокупателя(Реализация, 0, "долг покупателя после оплаты");
	ПроверитьРавенство(СуммаПродажи, ОстатокДенег(Контекст.Касса), "деньги в кассе после оплаты");

	Текст = "остаток " + СтрокаЧисла(Остаток.Количество) + "; выручка "
		+ СтрокаЧисла(Продажи.Выручка) + ", себестоимость " + СтрокаЧисла(Продажи.Себестоимость)
		+ "; долг закрыт " + ПредставлениеДокумента(Оплата);
	Возврат РезультатСценария(Текст);

КонецФункции

// Возврат от покупателя по реализации: товар возвращается на склад той же партией,
// продажи сторнируются, долг покупателя гасится.
//
// Параметры:
//  Контекст - Структура - см. НовыйКонтекст
//
// Возвращаемое значение:
//  Структура - см. РезультатСценария
//
Функция СценарийВозвратОтПокупателя(Контекст)

	Числа = Контекст.Числа;
	ДокументЗакупки(Контекст, Контекст.Товар, Числа.КоличествоЗакупки, Числа.ЦенаЗакупки);
	Реализация = ДокументРеализации(Контекст, Контекст.Товар, Числа.КоличествоПродажи, Числа.ЦенаПродажи);

	ДокВозврата = НовыйДокумент(Контекст, "ВозвратОтПокупателя");
	ДокВозврата.Заполнить(Реализация);
	ДокВозврата.Дата = СледующаяДата(Контекст);
	ДокВозврата.ХозяйственнаяОперация = Перечисления.ХозяйственныеОперации.ВозвратТоваровОтКлиента;
	Провести(ДокВозврата);

	КоличествоВозврата = ДокВозврата.ТЧТовары.Итог("Количество");
	ПроверитьРавенство(Числа.КоличествоПродажи, КоличествоВозврата, "количество в возврате по реализации");

	Остаток = ОстатокТовара(Контекст.Склад, Контекст.Товар);
	ПроверитьРавенство(Числа.КоличествоЗакупки, Остаток.Количество, "остаток товара после возврата");
	ПроверитьРавенство(Числа.КоличествоЗакупки * Числа.ЦенаЗакупки, Остаток.Сумма, "себестоимость остатка после возврата");

	Продажи = ОборотыПродаж(Реализация);
	ПроверитьРавенство(0, Продажи.Количество, "количество продаж после возврата");
	ПроверитьРавенство(0, Продажи.Выручка, "выручка после возврата");
	ПроверитьДолгПокупателя(Реализация, 0, "долг покупателя после возврата");

	Текст = "товар вернулся на склад (" + СтрокаЧисла(Остаток.Количество)
		+ "), продажи сторнированы, долг покупателя закрыт";
	Возврат РезультатСценария(Текст);

КонецФункции

// Выпуск продукции по технологической карте: сырьё списывается, продукция приходуется
// по себестоимости сырья. Работает под функциональной опцией «Производство».
//
// Параметры:
//  Контекст - Структура - см. НовыйКонтекст
//
// Возвращаемое значение:
//  Структура - см. РезультатСценария
//
Функция СценарийВыпускПродукции(Контекст)

	Если Не ПолучитьФункциональнуюОпцию("Производство") Тогда
		Возврат РезультатСценария("функциональная опция «Производство» выключена", Истина);
	КонецЕсли;

	Числа = Контекст.Числа;
	ДокументЗакупки(Контекст, Контекст.Сырье, Числа.КоличествоСырья, Числа.ЦенаСырья);

	Выпуск = НовыйДокумент(Контекст, "ВыпускПродукции");
	Выпуск.Номенклатура = Контекст.Продукция;
	Выпуск.Упаковка = Контекст.Единица;
	Выпуск.КоличествоУпаковок = Числа.КоличествоВыпуска;
	Выпуск.Количество = Числа.КоличествоВыпуска;
	Выпуск.МестоХраненияОприходование = Контекст.Склад;
	ЗаполнитьСырьеПоТехкарте(Контекст, Выпуск, Числа.КоличествоВыпуска);
	Провести(Выпуск);

	РасходСырья = Числа.РасходСырьяНаЕдиницу * Числа.КоличествоВыпуска;
	Себестоимость = РасходСырья * Числа.ЦенаСырья;

	ПроверитьРавенство(1, Выпуск.ТЧГотоваяПродукция.Количество(), "строк готовой продукции в выпуске");
	ОстатокСырья = ОстатокТовара(Контекст.Склад, Контекст.Сырье);
	ПроверитьРавенство(Числа.КоличествоСырья - РасходСырья, ОстатокСырья.Количество, "остаток сырья после выпуска");
	ОстатокПродукции = ОстатокТовара(Контекст.Склад, Контекст.Продукция);
	ПроверитьРавенство(Числа.КоличествоВыпуска, ОстатокПродукции.Количество, "остаток продукции после выпуска");
	ПроверитьРавенство(Себестоимость, ОстатокПродукции.Сумма, "себестоимость продукции после выпуска");

	Текст = "списано сырья " + СтрокаЧисла(РасходСырья) + ", продукции "
		+ СтрокаЧисла(ОстатокПродукции.Количество) + " на " + СтрокаЧисла(ОстатокПродукции.Сумма);
	Возврат РезультатСценария(Текст);

КонецФункции

// Переработка: передача сырья переработчику и поступление продукции. Сырьё уходит со
// склада к переработчику, возвращается продукцией с себестоимостью сырья и услуг,
// стоимость услуг становится долгом перед переработчиком.
//
// Параметры:
//  Контекст - Структура - см. НовыйКонтекст
//
// Возвращаемое значение:
//  Структура - см. РезультатСценария
//
Функция СценарийПереработка(Контекст)

	Числа = Контекст.Числа;
	ДокументЗакупки(Контекст, Контекст.Сырье, Числа.КоличествоСырья, Числа.ЦенаСырья);
	РасходСырья = Числа.РасходСырьяНаЕдиницу * Числа.КоличествоВыпуска;
	СебестоимостьСырья = РасходСырья * Числа.ЦенаСырья;

	Передача = НовыйДокумент(Контекст, "ПередачаВПереработку");
	Передача.Контрагент = Контекст.Контрагент;
	ДобавитьСтрокуТоваров(Контекст, Передача, "ТЧТовары", Контекст.Сырье, РасходСырья, 0);
	ДобавитьСтрокуТоваров(Контекст, Передача, "ТЧГотоваяПродукция", Контекст.Продукция, Числа.КоличествоВыпуска, 0);
	Провести(Передача);

	ОстатокСырья = ОстатокТовара(Контекст.Склад, Контекст.Сырье);
	ПроверитьРавенство(Числа.КоличествоСырья - РасходСырья, ОстатокСырья.Количество, "остаток сырья после передачи");
	ВПереработке = ОстатокВПереработке(Контекст.Контрагент, Контекст.Сырье);
	ПроверитьРавенство(РасходСырья, ВПереработке.Количество, "сырьё у переработчика после передачи");
	ПроверитьРавенство(СебестоимостьСырья, ВПереработке.Сумма, "себестоимость сырья у переработчика");

	Поступление = НовыйДокумент(Контекст, "ПоступлениеИзПереработки");
	Поступление.Заполнить(Передача.Ссылка);
	Поступление.Дата = СледующаяДата(Контекст);
	Поступление.Комментарий = ПометкаТеста();
	Поступление.СтоимостьУслуг = Числа.СтоимостьУслугПереработки;
	Поступление.СтавкаНДСУслуг = Контекст.СтавкаНДС;
	Поступление.СуммаНДСУслуг = 0;
	Провести(Поступление);

	ПроверитьРавенство(РасходСырья, Поступление.ТЧТовары.Итог("Количество"), "сырьё в поступлении по передаче");
	ВПереработке = ОстатокВПереработке(Контекст.Контрагент, Контекст.Сырье);
	ПроверитьРавенство(0, ВПереработке.Количество, "сырьё у переработчика после поступления");
	ОстатокПродукции = ОстатокТовара(Контекст.Склад, Контекст.Продукция);
	ПроверитьРавенство(Числа.КоличествоВыпуска, ОстатокПродукции.Количество, "остаток продукции после переработки");
	ПроверитьРавенство(СебестоимостьСырья + Числа.СтоимостьУслугПереработки, ОстатокПродукции.Сумма,
		"себестоимость продукции с услугами переработчика");
	ПроверитьДолгПоставщику(Поступление.Ссылка, Числа.СтоимостьУслугПереработки, "долг переработчику за услуги");

	Текст = "сырьё " + СтрокаЧисла(РасходСырья) + " ушло и вернулось продукцией "
		+ СтрокаЧисла(ОстатокПродукции.Количество) + " на " + СтрокаЧисла(ОстатокПродукции.Сумма)
		+ "; долг переработчику " + СтрокаЧисла(Числа.СтоимостьУслугПереработки);
	Возврат РезультатСценария(Текст);

КонецФункции

// Зарплата: начисление даёт остаток по сотруднику, ведомость на выплату заполняется по
// начислению, расходный ордер по ведомости закрывает остаток и списывает деньги из кассы.
//
// Параметры:
//  Контекст - Структура - см. НовыйКонтекст
//
// Возвращаемое значение:
//  Структура - см. РезультатСценария
//
Функция СценарийЗарплата(Контекст)

	ДатаНачала = Константы.ДатаНачалаРасчетаЗарплаты.Получить();
	Если Контекст.Дата < ДатаНачала Тогда
		Текст = "дата начала расчёта зарплаты " + Формат(ДатаНачала, "ДЛФ=D")
			+ " позже даты теста - движений по зарплате не будет";
		Возврат РезультатСценария(Текст, Истина);
	КонецЕсли;

	Оклад = Контекст.Числа.Оклад;
	Начисление = НовыйДокумент(Контекст, "НачислениеЗарплаты");
	Строка = Начисление.ТЧСотрудники.Добавить();
	Строка.Сотрудник = Контекст.Сотрудник;
	Строка.Оклад = Оклад;
	Строка.Сумма = Оклад;
	Начисление.Сумма = Оклад;
	Провести(Начисление);
	ПроверитьРавенство(Оклад, ОстатокЗарплаты(Контекст.Сотрудник), "остаток по сотруднику после начисления");

	Выплата = НовыйДокумент(Контекст, "ВыплатаЗарплаты");
	Выплата.Заполнить(Начисление.Ссылка);
	Выплата.Дата = СледующаяДата(Контекст);
	ПроверитьРавенство(Оклад, Выплата.ТЧСотрудники.Итог("Сумма"), "сумма ведомости по начислению");
	Провести(Выплата);

	Ордер = НовыйДокумент(Контекст, "РасходныйКассовыйОрдер");
	Ордер.ХозяйственнаяОперация = Перечисления.ХозяйственныеОперации.ВыплатаЗарплаты;
	Ордер.Основание = Выплата.Ссылка;
	Ордер.Контрагент = Контекст.Сотрудник;
	Ордер.Касса = Контекст.Касса;
	Ордер.ТипОплаты = Справочники.TypesDePayment.Cash;
	Ордер.СтатьяДДС = Справочники.СтатьиДвиженияДенежныхСредств.ВыплатаЗарплаты;
	Ордер.Сумма = Оклад;
	Провести(Ордер);

	ПроверитьРавенство(0, ОстатокЗарплаты(Контекст.Сотрудник), "остаток по сотруднику после выплаты");
	ПроверитьРавенство(-Оклад, ОстатокДенег(Контекст.Касса), "деньги в кассе после выплаты");

	Текст = "начислено и выплачено " + СтрокаЧисла(Оклад) + ", остаток по сотруднику 0";
	Возврат РезультатСценария(Текст);

КонецФункции

// Безналичные деньги: поступление от покупателя закрывает долг по реализации, списание
// поставщику закрывает долг по поступлению; остаток на счёте - разница.
//
// Параметры:
//  Контекст - Структура - см. НовыйКонтекст
//
// Возвращаемое значение:
//  Структура - см. РезультатСценария
//
Функция СценарийБезналичныеДеньги(Контекст)

	Числа = Контекст.Числа;
	Закупка = ДокументЗакупки(Контекст, Контекст.Товар, Числа.КоличествоЗакупки, Числа.ЦенаЗакупки);
	СуммаЗакупки = Числа.КоличествоЗакупки * Числа.ЦенаЗакупки;
	Реализация = ДокументРеализации(Контекст, Контекст.Товар, Числа.КоличествоПродажи, Числа.ЦенаПродажи);
	СуммаПродажи = Числа.КоличествоПродажи * Числа.ЦенаПродажи;

	Поступление = НовыйДокумент(Контекст, "ПоступлениеБезналичныхДенежныхСредств");
	Поступление.ХозяйственнаяОперация = Перечисления.ХозяйственныеОперации.ПоступлениеОплатыОтКлиента;
	Поступление.Контрагент = Контекст.Контрагент;
	Поступление.Договор = Контекст.ДоговорПокупателя;
	// BSLLS:YoLetterUsage-off
	Поступление.БанковскийСчёт = Контекст.Счет;
	// BSLLS:YoLetterUsage-on
	Поступление.ТипОплаты = Справочники.TypesDePayment.VirementBanquaire;
	Поступление.СтатьяДДС = СтатьяДДС(Контекст, Поступление.ХозяйственнаяОперация);
	Поступление.Сумма = СуммаПродажи;
	ДобавитьОснование(Поступление, Реализация, СуммаПродажи);
	Провести(Поступление);

	ПроверитьДолгПокупателя(Реализация, 0, "долг покупателя после безналичной оплаты");
	ПроверитьРавенство(СуммаПродажи, ОстатокДенег(Контекст.Счет), "деньги на счёте после поступления");

	Списание = НовыйДокумент(Контекст, "СписаниеБезналичныхДенежныхСредств");
	Списание.ХозяйственнаяОперация = Перечисления.ХозяйственныеОперации.ОплатаПоставщику;
	Списание.Контрагент = Контекст.Контрагент;
	Списание.Договор = Контекст.ДоговорПоставщика;
	// BSLLS:YoLetterUsage-off
	Списание.БанковскийСчёт = Контекст.Счет;
	// BSLLS:YoLetterUsage-on
	Списание.ТипОплаты = Справочники.TypesDePayment.VirementBanquaire;
	Списание.СтатьяДДС = СтатьяДДС(Контекст, Списание.ХозяйственнаяОперация);
	Списание.Валюта = Контекст.Валюта;
	Списание.Сумма = СуммаЗакупки;
	Списание.СуммаВВалютеРеглУчета = СуммаЗакупки;
	ДобавитьОснование(Списание, Закупка, СуммаЗакупки);
	Провести(Списание);

	ПроверитьДолгПоставщику(Закупка, 0, "долг поставщику после безналичной оплаты");
	ПроверитьРавенство(СуммаПродажи - СуммаЗакупки, ОстатокДенег(Контекст.Счет), "деньги на счёте после списания");

	Текст = "получено " + СтрокаЧисла(СуммаПродажи) + ", уплачено " + СтрокаЧисла(СуммаЗакупки)
		+ ", оба долга закрыты, на счёте " + СтрокаЧисла(СуммаПродажи - СуммаЗакупки);
	Возврат РезультатСценария(Текст);

КонецФункции

// Дополнительные реквизиты (УправлениеСвойствами): реквизит и сведение заводятся
// идемпотентно, значение реквизита живёт в табличной части объекта, сведения - в регистре,
// оба читаются по имени.
//
// Параметры:
//  Контекст - Структура - см. НовыйКонтекст
//
// Возвращаемое значение:
//  Структура - см. РезультатСценария
//
Функция СценарийДополнительныеРеквизиты(Контекст)

	ИмяОбъекта = "Справочник.Номенклатура";
	ИмяРеквизита = "ТестУровня3";
	ИмяСведения = "ТестУровня3Сведение";

	Параметры = УправлениеСвойствами.ПараметрыДобавленияСвойства();
	Параметры.ИмяОбъекта = ИмяОбъекта;
	Параметры.Имя = ИмяРеквизита;
	Параметры.Наименование = ПометкаТеста();
	Параметры.ТипЗначения = Новый ОписаниеТипов("Строка", , Новый КвалификаторыСтроки(ДлинаСтроковогоРеквизита()));
	Параметры.Заголовки.Вставить("fr", "Test niveau 3");
	Реквизит = УправлениеСвойствами.ДобавитьСвойство(Параметры);
	Проверить(ЗначениеЗаполнено(Реквизит), "дополнительный реквизит не создан");
	Повтор = УправлениеСвойствами.ДобавитьСвойство(Параметры);
	ПроверитьРавенство(Реквизит, Повтор, "повторное добавление реквизита");
	Найденный = УправлениеСвойствами.НайтиСвойство(ИмяОбъекта, ИмяРеквизита);
	ПроверитьРавенство(Реквизит, Найденный, "поиск реквизита по имени");

	Параметры.Имя = ИмяСведения;
	Параметры.ЭтоСведение = Истина;
	Параметры.ТипЗначения = Новый ОписаниеТипов("Число");
	Сведение = УправлениеСвойствами.ДобавитьСвойство(Параметры);
	Проверить(ЗначениеЗаполнено(Сведение) И Сведение <> Реквизит, "дополнительное сведение не создано");

	ЗначениеРеквизита = "Значение уровня 3";
	ЗначениеСведения = Контекст.Числа.ЦенаПродажи;

	Товар = Контекст.Товар.ПолучитьОбъект();
	Строка = Товар.ДополнительныеРеквизиты.Добавить();
	Строка.Свойство = Реквизит;
	Строка.Значение = ЗначениеРеквизита;
	Товар.Записать();

	Запись = РегистрыСведений.ДополнительныеСведения.СоздатьМенеджерЗаписи();
	Запись.Объект = Контекст.Товар;
	Запись.Свойство = Сведение;
	Запись.Значение = ЗначениеСведения;
	Запись.Записать();

	Прочитано = УправлениеСвойствами.ЗначениеСвойства(Контекст.Товар, ИмяРеквизита);
	ПроверитьРавенство(ЗначениеРеквизита, Прочитано, "значение реквизита из табличной части");
	Прочитано = УправлениеСвойствами.ЗначениеСвойства(Контекст.Товар, ИмяСведения);
	ПроверитьРавенство(ЗначениеСведения, Прочитано, "значение сведения из регистра");
	Прочитано = УправлениеСвойствами.ЗначениеСвойства(Контекст.Товар, "НетТакогоРеквизита");
	ПроверитьРавенство(Неопределено, Прочитано, "значение несуществующего реквизита");

	Возврат РезультатСценария("реквизит и сведение заведены идемпотентно, значения читаются по имени");

КонецФункции

// Отрасль: применение «Строительства» ставит константу и заводит реквизиты объекта
// недвижимости у номенклатуры, повтор ничего не создаёт, другая отрасль реквизитов не добавляет.
//
// Возвращаемое значение:
//  Структура - см. РезультатСценария
//
Функция СценарийОтрасль()

	ИмяОбъекта = "Справочник.Номенклатура";
	Имена = ИменаРеквизитовСтроительства();

	Было = 0;
	Для Каждого Имя Из Имена Цикл
		Если ЗначениеЗаполнено(УправлениеСвойствами.НайтиСвойство(ИмяОбъекта, Имя)) Тогда
			Было = Было + 1;
		КонецЕсли;
	КонецЦикла;

	// Модуль привилегированный: отрасль ставится от имени администратора при первом запуске,
	// тест проверяет тот же метод в своей транзакции.
	// BSLLS:PrivilegedModuleMethodCall-off
	Строительство = Перечисления.Отрасли.Строительство;
	Создано = НачальноеЗаполнениеВызовСервера.ПрименитьОтрасль(Строительство);
	ПроверитьРавенство(Имена.Количество() - Было, Создано, "создано реквизитов строительства");
	Отрасль = Константы.Отрасль.Получить();
	ПроверитьРавенство(Строительство, Отрасль, "константа Отрасль");
	Для Каждого Имя Из Имена Цикл
		Свойство = УправлениеСвойствами.НайтиСвойство(ИмяОбъекта, Имя);
		Проверить(ЗначениеЗаполнено(Свойство), "после применения отрасли нет реквизита " + Имя);
	КонецЦикла;

	Повтор = НачальноеЗаполнениеВызовСервера.ПрименитьОтрасль(Строительство);
	ПроверитьРавенство(0, Повтор, "создано реквизитов при повторном применении");

	Торговля = Перечисления.Отрасли.Торговля;
	СозданоДляТорговли = НачальноеЗаполнениеВызовСервера.ПрименитьОтрасль(Торговля);
	ПроверитьРавенство(0, СозданоДляТорговли, "создано реквизитов для торговли");
	// BSLLS:PrivilegedModuleMethodCall-on
	Отрасль = Константы.Отрасль.Получить();
	ПроверитьРавенство(Торговля, Отрасль, "константа Отрасль после торговли");

	Текст = "строительство: создано " + СтрокаЧисла(Создано) + " из " + СтрокаЧисла(Имена.Количество())
		+ " реквизитов, повтор 0; торговля: 0";
	Возврат РезультатСценария(Текст);

КонецФункции

// Панель настроек: запись константы модулем менеджера, признак расположения ФО,
// имя константы по пути данных, список часовых поясов, заголовок окна.
//
// Возвращаемое значение:
//  Структура - см. РезультатСценария
//
Функция СценарийНастройкиПрограммы()

	Новое = ПометкаТеста();
	ЭтоОпция = Обработки.НастройкиПрограммы.ЗаписатьКонстанту("ЗаголовокСистемы", Новое);
	ПроверитьРавенство(Ложь, ЭтоОпция, "ЗаголовокСистемы как расположение функциональной опции");
	Записано = Константы.ЗаголовокСистемы.Получить();
	ПроверитьРавенство(Новое, Записано, "значение константы после записи");

	ЭтоОпция = Обработки.НастройкиПрограммы.ЭтоРасположениеФункциональнойОпции("Бухгалтерия");
	ПроверитьРавенство(Истина, ЭтоОпция, "Бухгалтерия как расположение функциональной опции");

	ИмяКонстанты = Обработки.НастройкиПрограммы.ИмяКонстантыПоПутиДанных("НаборКонстант.ЗаголовокСистемы");
	ПроверитьРавенство("ЗаголовокСистемы", ИмяКонстанты, "имя константы по пути данных");

	Варианты = Обработки.НастройкиПрограммы.ВариантыЧасовыхПоясов();
	Проверить(Варианты.Количество() > 0, "список часовых поясов пуст");
	Текущий = Обработки.НастройкиПрограммы.ТекущийЧасовойПояс();
	Проверить(Варианты.НайтиПоЗначению(Текущий) <> Неопределено, "текущий часовой пояс " + Текущий + " не в списке");

	Заголовок = Обработки.НастройкиПрограммы.ЗаголовокОкнаПрограммы();
	Проверить(СтрНайти(Заголовок, Новое) > 0, "заголовок окна не содержит заголовок системы");

	Текст = "константа записана и прочитана, признак ФО верен, часовых поясов " + СтрокаЧисла(Варианты.Количество())
		+ ", текущий " + Текущий;
	Возврат РезультатСценария(Текст);

КонецФункции

// Имена дополнительных реквизитов номенклатуры, которые заводит отрасль «Строительство»
// (НачальноеЗаполнениеВызовСервера.ОтраслевыеРеквизитыСтроительства).
//
// Возвращаемое значение:
//  Массив из Строка - имена реквизитов
//
Функция ИменаРеквизитовСтроительства()

	Имена = Новый Массив;
	Имена.Добавить("ОбъектНедвижимости");
	Имена.Добавить("Этаж");
	Имена.Добавить("Площадь");
	Имена.Добавить("НомерПраваСобственности");
	Возврат Имена;

КонецФункции

#КонецОбласти

#Область ДанныеСценариев

// Данные, общие для сценариев. Всё, что записывается, заводится заново внутри
// транзакции сценария и откатывается вместе с ней; из базы берутся только организация,
// валюта учёта и предопределённые элементы. Свежая номенклатура и склад дают нулевые
// остатки - ожидаемые значения не зависят от содержимого базы.
//
// Возвращаемое значение:
//  Структура - контекст сценария
//
Функция НовыйКонтекст()

	Контекст = Новый Структура;
	Контекст.Вставить("Числа", ЧислаСценариев());
	// Документы датируются чуть раньше текущего момента и с шагом в секунду: так
	// порядок документов на оси времени регистров совпадает с порядком их создания.
	Контекст.Вставить("Дата", ТекущаяДатаСеанса() - ЗапасСекунд());
	Контекст.Вставить("Шаг", 0);

	Организация = Обработки.ТестовыеДанные.ПервыйЭлемент("Организации");
	Проверить(ЗначениеЗаполнено(Организация), "в базе нет ни одной организации");
	Контекст.Вставить("Организация", Организация);

	Валюта = Константы.ВалютаРегламентированногоУчета.Получить();
	Если Не ЗначениеЗаполнено(Валюта) Тогда
		Валюта = Обработки.ТестовыеДанные.ПервыйЭлемент("Валюты");
	КонецЕсли;
	Проверить(ЗначениеЗаполнено(Валюта), "не задана валюта регламентированного учёта и нет ни одной валюты");
	Контекст.Вставить("Валюта", Валюта);
	Контекст.Вставить("СтавкаНДС", Справочники.СтавкиНДС.SansTVA);

	Контекст.Вставить("Единица", НоваяЕдиница());
	Контекст.Вставить("Склад", НовыйСклад());
	Контекст.Вставить("Контрагент", НовыйКонтрагент());
	Контекст.Вставить("ДоговорПокупателя", НовыйДоговор(Контекст, Перечисления.ВидыДоговоров.СПокупателем));
	Контекст.Вставить("ДоговорПоставщика", НовыйДоговор(Контекст, Перечисления.ВидыДоговоров.СПоставщиком));
	Контекст.Вставить("Касса", НоваяКасса(Контекст));
	Контекст.Вставить("Счет", НовыйБанковскийСчет(Контекст));
	Контекст.Вставить("Сотрудник", НовоеФизическоеЛицо());
	Контекст.Вставить("Товар", НоваяНоменклатура(Контекст, "товар", Перечисления.ТипыНоменклатуры.Товар));
	Контекст.Вставить("Сырье", НоваяНоменклатура(Контекст, "сырьё", Перечисления.ТипыНоменклатуры.Сырье));
	Контекст.Вставить("Продукция", НоваяПродукция(Контекст));
	Контекст.Вставить("СтатьяДДСЗапасная", Справочники.СтатьиДвиженияДенежныхСредств.ПустаяСсылка());

	Возврат Контекст;

КонецФункции

// Количества и цены сценариев в одном месте: ожидаемые значения считаются из них же.
//
// Возвращаемое значение:
//  Структура - количества и цены по именам
//
Функция ЧислаСценариев()

	// BSLLS:MagicNumber-off
	Числа = Новый Структура;
	Числа.Вставить("КоличествоЗакупки", 10);
	Числа.Вставить("ЦенаЗакупки", 50);
	Числа.Вставить("КоличествоПродажи", 3);
	Числа.Вставить("ЦенаПродажи", 100);
	Числа.Вставить("КоличествоСырья", 20);
	Числа.Вставить("ЦенаСырья", 10);
	Числа.Вставить("РасходСырьяНаЕдиницу", 2);
	Числа.Вставить("КоличествоВыпуска", 5);
	Числа.Вставить("СтоимостьУслугПереработки", 50);
	Числа.Вставить("Оклад", 1000);
	// BSLLS:MagicNumber-on
	Возврат Числа;

КонецФункции

Функция ЗапасСекунд()

	// Первый документ сценария датируется на столько секунд раньше текущего момента.
	// BSLLS:MagicNumber-off
	Возврат 100;
	// BSLLS:MagicNumber-on

КонецФункции

Функция ДлинаСтроковогоРеквизита()

	// BSLLS:MagicNumber-off
	Возврат 50;
	// BSLLS:MagicNumber-on

КонецФункции

// Дата следующего документа сценария: на секунду позже предыдущего.
//
// Параметры:
//  Контекст - Структура - см. НовыйКонтекст
//
// Возвращаемое значение:
//  Дата - дата документа
//
Функция СледующаяДата(Контекст)

	Контекст.Шаг = Контекст.Шаг + 1;
	Возврат Контекст.Дата + Контекст.Шаг;

КонецФункции

// Пометка в наименованиях и комментариях: по ней видно, что объект заведён автотестом.
//
// Возвращаемое значение:
//  Строка - текст пометки
//
Функция ПометкаТеста()

	Возврат "Тест уровня 3";

КонецФункции

Функция НоваяЕдиница()

	Единица = Справочники.УпаковкиЕдиницыИзмерения.СоздатьЭлемент();
	Единица.Наименование = "шт (" + ПометкаТеста() + ")";
	Единица.ТипИзмеряемойВеличины = Перечисления.ТипыИзмеряемыхВеличин.КоличествоШтук;
	Единица.Числитель = 1;
	Единица.Знаменатель = 1;
	Единица.Записать();
	Возврат Единица.Ссылка;

КонецФункции

Функция НовыйСклад()

	Склад = Справочники.МестаХранения.СоздатьЭлемент();
	Склад.Наименование = ПометкаТеста() + ": склад";
	Склад.Записать();
	Возврат Склад.Ссылка;

КонецФункции

Функция НовыйКонтрагент()

	Контрагент = Справочники.Контрагенты.СоздатьЭлемент();
	Контрагент.Наименование = ПометкаТеста() + ": контрагент";
	Контрагент.НаименованиеПолное = Контрагент.Наименование;
	Контрагент.ВидКонтрагента = Перечисления.ВидыКонтрагентов.ЮридическоеЛицо;
	Контрагент.Покупатель = Истина;
	Контрагент.Поставщик = Истина;
	// Переработчиком может быть только субподрядчик (проверка заполнения передачи в переработку).
	Контрагент.Субподрядчик = Истина;
	Контрагент.ICE = "TEST3";
	Контрагент.Записать();
	Возврат Контрагент.Ссылка;

КонецФункции

Функция НовыйДоговор(Контекст, ВидДоговора)

	Договор = Справочники.ДоговорыСКонтрагентами.СоздатьЭлемент();
	Договор.Наименование = ПометкаТеста() + ": " + Строка(ВидДоговора);
	Договор.Контрагент = Контекст.Контрагент;
	Договор.Организация = Контекст.Организация;
	Договор.ВидДоговора = ВидДоговора;
	Договор.Статус = Перечисления.СтатусыДоговоровКонтрагентов.Действует;
	// BSLLS:YoLetterUsage-off
	Договор.ВалютаВзаиморасчётов = Контекст.Валюта;
	// BSLLS:YoLetterUsage-on
	Договор.ДатаДоговора = НачалоДня(Контекст.Дата);
	Договор.Основной = Истина;
	Договор.Записать();
	Возврат Договор.Ссылка;

КонецФункции

Функция НоваяКасса(Контекст)

	Касса = Справочники.Кассы.СоздатьЭлемент();
	Касса.Владелец = Контекст.Организация;
	Касса.Наименование = ПометкаТеста() + ": касса";
	Касса.Валюта = Контекст.Валюта;
	Касса.МестоХранения = Контекст.Склад;
	Касса.Записать();
	Возврат Касса.Ссылка;

КонецФункции

Функция НовыйБанковскийСчет(Контекст)

	Счет = Справочники.БанковскиеСчета.СоздатьЭлемент();
	Счет.Владелец = Контекст.Организация;
	Счет.Наименование = ПометкаТеста() + ": счёт";
	Счет.Валюта = Контекст.Валюта;
	// Имена реквизитов справочника - с буквой ё, как в метаданных.
	// BSLLS:YoLetterUsage-off
	Счет.НомерСчёта = "TEST-3";
	Счет.ТипСчёта = Перечисления.ТипыБанковскихСчетов.Расчетный;
	// BSLLS:YoLetterUsage-on
	Счет.Банк = Обработки.ТестовыеДанные.ПервыйЭлемент("Банки");
	Счет.Записать();
	Возврат Счет.Ссылка;

КонецФункции

Функция НовоеФизическоеЛицо()

	Лицо = Справочники.ФизическиеЛица.СоздатьЭлемент();
	Лицо.Наименование = ПометкаТеста() + ": сотрудник";
	Лицо.Фамилия = ПометкаТеста();
	Лицо.Имя = "Сотрудник";
	Лицо.Записать();
	Возврат Лицо.Ссылка;

КонецФункции

Функция НоваяНоменклатура(Контекст, Название, ТипНоменклатуры)

	Номенклатура = Справочники.Номенклатура.СоздатьЭлемент();
	Номенклатура.Наименование = ПометкаТеста() + ": " + Название;
	Номенклатура.НаименованиеПолное = Номенклатура.Наименование;
	Номенклатура.ТипНоменклатуры = ТипНоменклатуры;
	Номенклатура.Единица = Контекст.Единица;
	Номенклатура.СтавкаНДС = Контекст.СтавкаНДС;
	Номенклатура.Записать();
	Возврат Номенклатура.Ссылка;

КонецФункции

// Продукция с технологической картой: на единицу уходит РасходСырьяНаЕдиницу сырья.
//
// Параметры:
//  Контекст - Структура - см. НовыйКонтекст
//
// Возвращаемое значение:
//  СправочникСсылка.Номенклатура - записанная продукция
//
Функция НоваяПродукция(Контекст)

	Продукция = Справочники.Номенклатура.СоздатьЭлемент();
	Продукция.Наименование = ПометкаТеста() + ": продукция";
	Продукция.НаименованиеПолное = Продукция.Наименование;
	Продукция.ТипНоменклатуры = Перечисления.ТипыНоменклатуры.Продукция;
	Продукция.Единица = Контекст.Единица;
	Продукция.СтавкаНДС = Контекст.СтавкаНДС;
	СтрокаКарты = Продукция.ТехнологическаяКарта.Добавить();
	СтрокаКарты.Номенклатура = Контекст.Сырье;
	СтрокаКарты.Количество = Контекст.Числа.РасходСырьяНаЕдиницу;
	СтрокаКарты.ЕИ = Контекст.Единица;
	Продукция.Записать();
	Возврат Продукция.Ссылка;

КонецФункции

// Статья ДДС для денежного документа: настроенная на операцию, а если такой нет -
// одна запасная статья на сценарий.
//
// Параметры:
//  Контекст              - Структура - см. НовыйКонтекст
//  ХозяйственнаяОперация - ПеречислениеСсылка.ХозяйственныеОперации - операция документа
//
// Возвращаемое значение:
//  СправочникСсылка.СтатьиДвиженияДенежныхСредств - статья
//
Функция СтатьяДДС(Контекст, ХозяйственнаяОперация)

	Статья = ОбщегоНазначенияВызовСервера.ПолучитьСтатьюДДСПоХозяйственнойОперации(ХозяйственнаяОперация);
	Если ЗначениеЗаполнено(Статья) Тогда
		Возврат Статья;
	КонецЕсли;

	Если Не ЗначениеЗаполнено(Контекст.СтатьяДДСЗапасная) Тогда
		Запасная = Справочники.СтатьиДвиженияДенежныхСредств.СоздатьЭлемент();
		Запасная.Наименование = ПометкаТеста() + ": статья ДДС";
		Запасная.Записать();
		Контекст.СтатьяДДСЗапасная = Запасная.Ссылка;
	КонецЕсли;

	Возврат Контекст.СтатьяДДСЗапасная;

КонецФункции

#КонецОбласти

#Область Документы

// Новый документ с реквизитами по умолчанию, организацией и складом сценария.
//
// Параметры:
//  Контекст     - Структура - см. НовыйКонтекст
//  ИмяДокумента - Строка    - имя объекта метаданных
//
// Возвращаемое значение:
//  ДокументОбъект - незаписанный документ
//
Функция НовыйДокумент(Контекст, ИмяДокумента)

	Док = Документы[ИмяДокумента].СоздатьДокумент();
	РаботаСДокументами.ЗаполнитьРеквизитыПоУмолчанию(Док);
	Док.Дата = СледующаяДата(Контекст);

	Реквизиты = Док.Метаданные().Реквизиты;
	Если Реквизиты.Найти("Организация") <> Неопределено Тогда
		Док.Организация = Контекст.Организация;
	КонецЕсли;
	Если Реквизиты.Найти("МестоХранения") <> Неопределено Тогда
		Док.МестоХранения = Контекст.Склад;
	КонецЕсли;
	Если Реквизиты.Найти("Комментарий") <> Неопределено Тогда
		Док.Комментарий = ПометкаТеста();
	КонецЕсли;

	Возврат Док;

КонецФункции

// Проверка заполнения, запись с проведением и контроль результата. Ошибка проведения
// приходит исключением платформы, сообщения из ОбработкаПроведения добавляет ВыполнитьСценарий.
//
// Параметры:
//  Док - ДокументОбъект - заполняемый документ
//
Процедура Провести(Док)

	Если Не Док.ПроверитьЗаполнение() Тогда
		ВызватьИсключение ПредставлениеДокумента(Док) + ": не прошла проверка заполнения" + СообщенияПользователю();
	КонецЕсли;
	Док.Записать(РежимЗаписиДокумента.Проведение);
	Проверить(Док.Проведен, ПредставлениеДокумента(Док) + ": записан, но не проведён");

КонецПроцедуры

// Проверка заполнения и запись документа, у которого проведение запрещено.
//
// Параметры:
//  Док - ДокументОбъект - заполняемый документ
//
Процедура Записать(Док)

	Если Не Док.ПроверитьЗаполнение() Тогда
		ВызватьИсключение ПредставлениеДокумента(Док) + ": не прошла проверка заполнения" + СообщенияПользователю();
	КонецЕсли;
	Док.Записать();

КонецПроцедуры

Функция ПредставлениеДокумента(Док)

	Представление = Док.Метаданные().Имя;
	Если ЗначениеЗаполнено(Док.Номер) Тогда
		Представление = Представление + " № " + СокрЛП(Док.Номер);
	КонецЕсли;
	Возврат Представление;

КонецФункции

// Строка товарной табличной части: заполняются те колонки, которые у части есть.
//
// Параметры:
//  Контекст     - Структура      - см. НовыйКонтекст
//  Док          - ДокументОбъект - заполняемый документ
//  ИмяТЧ        - Строка         - имя табличной части
//  Номенклатура - СправочникСсылка.Номенклатура
//  Количество   - Число
//  Цена         - Число - 0, если у части нет цены
//
Процедура ДобавитьСтрокуТоваров(Контекст, Док, ИмяТЧ, Номенклатура, Количество, Цена)

	Колонки = Док.Метаданные().ТабличныеЧасти[ИмяТЧ].Реквизиты;
	Строка = Док[ИмяТЧ].Добавить();
	Сумма = Количество * Цена;

	ЗаполнитьКолонку(Строка, Колонки, "КодСтроки", Док[ИмяТЧ].Количество());
	ЗаполнитьКолонку(Строка, Колонки, "Номенклатура", Номенклатура);
	ЗаполнитьКолонку(Строка, Колонки, "Упаковка", Контекст.Единица);
	ЗаполнитьКолонку(Строка, Колонки, "КоличествоУпаковок", Количество);
	ЗаполнитьКолонку(Строка, Колонки, "Количество", Количество);
	ЗаполнитьКолонку(Строка, Колонки, "Цена", Цена);
	ЗаполнитьКолонку(Строка, Колонки, "Сумма", Сумма);
	ЗаполнитьКолонку(Строка, Колонки, "СуммаСНДС", Сумма);
	ЗаполнитьКолонку(Строка, Колонки, "СтавкаНДС", Контекст.СтавкаНДС);
	ЗаполнитьКолонку(Строка, Колонки, "СуммаНДС", 0);

КонецПроцедуры

Процедура ЗаполнитьКолонку(Строка, Колонки, ИмяКолонки, Значение)

	Если Колонки.Найти(ИмяКолонки) <> Неопределено Тогда
		Строка[ИмяКолонки] = Значение;
	КонецЕсли;

КонецПроцедуры

// Строка оснований платёжного документа: по ней закрывается долг по документу расчётов.
//
// Параметры:
//  Док       - ДокументОбъект - заполняемый документ
//  Основание - ДокументСсылка - документ расчётов
//  Сумма     - Число - сумма
//
Процедура ДобавитьОснование(Док, Основание, Сумма)

	Строка = Док.ТЧОснования.Добавить();
	Строка.Основание = Основание;
	Строка.Сумма = Сумма;

КонецПроцедуры

// Сырьё выпуска по технологической карте продукции: расход на единицу умножается на выпуск.
//
// Параметры:
//  Контекст          - Структура - см. НовыйКонтекст
//  Выпуск            - ДокументОбъект.ВыпускПродукции - заполняемый выпуск
//  КоличествоВыпуска - Число - сколько продукции выпускается
//
Процедура ЗаполнитьСырьеПоТехкарте(Контекст, Выпуск, КоличествоВыпуска)

	Для Каждого СтрокаКарты Из Выпуск.Номенклатура.ТехнологическаяКарта Цикл
		ДобавитьСтрокуТоваров(Контекст, Выпуск, "ТЧТовары", СтрокаКарты.Номенклатура,
			СтрокаКарты.Количество * КоличествоВыпуска, 0);
	КонецЦикла;
	Проверить(Выпуск.ТЧТовары.Количество() > 0, "у продукции нет технологической карты");

КонецПроцедуры

// Проведённое поступление товаров от контрагента сценария.
//
// Параметры:
//  Контекст     - Структура - см. НовыйКонтекст
//  Номенклатура - СправочникСсылка.Номенклатура - позиция номенклатуры
//  Количество   - Число - количество в единицах
//  Цена         - Число - цена; 0, если у части нет цены
//
// Возвращаемое значение:
//  ДокументСсылка.ПоступлениеТоваровУслуг - проведённое поступление
//
Функция ДокументЗакупки(Контекст, Номенклатура, Количество, Цена)

	Док = НовыйДокумент(Контекст, "ПоступлениеТоваровУслуг");
	Док.ХозяйственнаяОперация = Перечисления.ХозяйственныеОперации.ЗакупкаУПоставщика;
	Док.Контрагент = Контекст.Контрагент;
	Док.Договор = Контекст.ДоговорПоставщика;
	Док.ЦенаВключаетНДС = Истина;
	Док.Валюта = Контекст.Валюта;
	Док.КурсВалюты = 1;
	ДобавитьСтрокуТоваров(Контекст, Док, "ТЧТовары", Номенклатура, Количество, Цена);
	Провести(Док);
	Возврат Док.Ссылка;

КонецФункции

// Записанный заказ покупателя (проведение у заказа запрещено).
//
// Параметры:
//  Контекст     - Структура - см. НовыйКонтекст
//  Номенклатура - СправочникСсылка.Номенклатура - позиция номенклатуры
//  Количество   - Число - количество в единицах
//  Цена         - Число - цена; 0, если у части нет цены
//
// Возвращаемое значение:
//  ДокументСсылка.ЗаказПокупателя - записанный заказ
//
Функция ДокументЗаказаПокупателя(Контекст, Номенклатура, Количество, Цена)

	Док = НовыйДокумент(Контекст, "ЗаказПокупателя");
	Док.Контрагент = Контекст.Контрагент;
	Док.Договор = Контекст.ДоговорПокупателя;
	Док.ЦенаВключаетНДС = Истина;
	Док.ДатаОтгрузки = Док.Дата;
	ДобавитьСтрокуТоваров(Контекст, Док, "ТЧТовары", Номенклатура, Количество, Цена);
	Записать(Док);
	Возврат Док.Ссылка;

КонецФункции

// Проведённая реализация, введённая на основании заказа: состав и контрагент - из заказа.
//
// Параметры:
//  Контекст - Структура - см. НовыйКонтекст
//  Заказ    - ДокументСсылка.ЗаказПокупателя - заказ-основание
//
// Возвращаемое значение:
//  ДокументСсылка.РеализацияТоваровУслуг - проведённая реализация
//
Функция ДокументРеализацииПоЗаказу(Контекст, Заказ)

	Док = НовыйДокумент(Контекст, "РеализацияТоваровУслуг");
	Док.Заполнить(Заказ);
	Док.Дата = СледующаяДата(Контекст);
	Док.МестоХранения = Контекст.Склад;
	Док.Комментарий = ПометкаТеста();
	Провести(Док);
	Возврат Док.Ссылка;

КонецФункции

// Проведённая реализация без заказа.
//
// Параметры:
//  Контекст     - Структура - см. НовыйКонтекст
//  Номенклатура - СправочникСсылка.Номенклатура - позиция номенклатуры
//  Количество   - Число - количество в единицах
//  Цена         - Число - цена; 0, если у части нет цены
//
// Возвращаемое значение:
//  ДокументСсылка.РеализацияТоваровУслуг - проведённая реализация
//
Функция ДокументРеализации(Контекст, Номенклатура, Количество, Цена)

	Док = НовыйДокумент(Контекст, "РеализацияТоваровУслуг");
	Док.ХозяйственнаяОперация = Перечисления.ХозяйственныеОперации.РеализацияКлиенту;
	Док.Контрагент = Контекст.Контрагент;
	Док.Договор = Контекст.ДоговорПокупателя;
	Док.ЦенаВключаетНДС = Истина;
	ДобавитьСтрокуТоваров(Контекст, Док, "ТЧТовары", Номенклатура, Количество, Цена);
	Провести(Док);
	Возврат Док.Ссылка;

КонецФункции

// Проведённый приходный кассовый ордер в оплату реализации.
//
// Параметры:
//  Контекст   - Структура - см. НовыйКонтекст
//  Реализация - ДокументСсылка.РеализацияТоваровУслуг - оплачиваемая реализация
//  Сумма      - Число - сумма
//
// Возвращаемое значение:
//  ДокументОбъект.ПриходныйКассовыйОрдер - проведённый ордер
//
Функция ДокументОплатыВКассу(Контекст, Реализация, Сумма)

	Док = НовыйДокумент(Контекст, "ПриходныйКассовыйОрдер");
	Док.ХозяйственнаяОперация = Перечисления.ХозяйственныеОперации.ПоступлениеОплатыОтКлиента;
	Док.Контрагент = Контекст.Контрагент;
	Док.Договор = Контекст.ДоговорПокупателя;
	Док.Касса = Контекст.Касса;
	Док.ТипОплаты = Справочники.TypesDePayment.Cash;
	Док.СтатьяДДС = СтатьяДДС(Контекст, Док.ХозяйственнаяОперация);
	Док.Сумма = Сумма;
	ДобавитьОснование(Док, Реализация, Сумма);
	Провести(Док);
	Возврат Док;

КонецФункции

#КонецОбласти

#Область Проверки

Процедура Проверить(Условие, Описание)

	Если Не Условие Тогда
		ВызватьИсключение Описание;
	КонецЕсли;

КонецПроцедуры

Процедура ПроверитьРавенство(Ожидалось, Получено, Описание)

	Если Ожидалось <> Получено Тогда
		ВызватьИсключение Описание + ": ожидалось " + СтрокаЗначения(Ожидалось)
			+ ", получено " + СтрокаЗначения(Получено);
	КонецЕсли;

КонецПроцедуры

// Долг покупателя по документу расчётов: положительный остаток регистра
// (РегистрыНакопления.ВзаиморасчётыСПокупателями.ПолучитьЗадолженностьКлиентовПоКлассификации).
//
// Параметры:
//  ОбъектРасчетов - ДокументСсылка - документ расчётов
//  Долг           - Число - ожидаемый долг
//  Описание       - Строка - что проверялось
//
Процедура ПроверитьДолгПокупателя(ОбъектРасчетов, Долг, Описание)

	ПроверитьРавенство(Долг, ОстатокВзаиморасчетов("ВзаиморасчётыСПокупателями", ОбъектРасчетов), Описание);

КонецПроцедуры

// Долг поставщику по документу расчётов: отрицательный остаток регистра - так его читает
// РегистрыНакопления.ВзаиморасчётыСПоставщиками.ПолучитьЗадолженностьПоставшиковПоКлассификации,
// и так его гасит оплата поставщику (приход).
//
// Параметры:
//  ОбъектРасчетов - ДокументСсылка - документ расчётов
//  Долг           - Число - ожидаемый долг
//  Описание       - Строка - что проверялось
//
Процедура ПроверитьДолгПоставщику(ОбъектРасчетов, Долг, Описание)

	ПроверитьРавенство(-Долг, ОстатокВзаиморасчетов("ВзаиморасчётыСПоставщиками", ОбъектРасчетов), Описание);

КонецПроцедуры

Функция СтрокаЗначения(Значение)

	Если ТипЗнч(Значение) = Тип("Число") Тогда
		Возврат СтрокаЧисла(Значение);
	КонецЕсли;
	Возврат Строка(Значение);

КонецФункции

// Число без разделителей групп и с явным нулём - строку отчёта проще читать и разбирать.
//
// Параметры:
//  Значение - Произвольный - значение
//
// Возвращаемое значение:
//  Строка - число без разделителей групп
//
Функция СтрокаЧисла(Значение)

	Возврат Формат(Значение, "ЧГ=0; ЧН=0");

КонецФункции

// Ошибка одной строкой: перевод строки в отчёте разделяет записи.
//
// Параметры:
//  Информация - ИнформацияОбОшибке - перехваченная ошибка
//
// Возвращаемое значение:
//  Строка - описание ошибки в одну строку
//
Функция ОшибкаОднойСтрокой(Информация)

	// BSLLS:DeprecatedMethodCall-off
	Возврат СтрЗаменить(ПодробноеПредставлениеОшибки(Информация), Символы.ПС, " | ");
	// BSLLS:DeprecatedMethodCall-on

КонецФункции

// Накопленные сообщения пользователю одной строкой: в них причина отказа в проведении.
//
// Возвращаемое значение:
//  Строка - тексты сообщений через разделитель; пустая, если сообщений нет
//
Функция СообщенияПользователю()

	Части = Новый Массив;
	Для Каждого Сообщение Из ПолучитьСообщенияПользователю(Истина) Цикл
		Части.Добавить(СтрЗаменить(Сообщение.Текст, Символы.ПС, " "));
	КонецЦикла;
	Если Части.Количество() = 0 Тогда
		Возврат "";
	КонецЕсли;
	Возврат " | " + СтрСоединить(Части, " | ");

КонецФункции

#КонецОбласти

#Область Регистры

// Остаток номенклатуры на складе: количество и себестоимость.
//
// Параметры:
//  Склад        - СправочникСсылка.МестаХранения - склад
//  Номенклатура - СправочникСсылка.Номенклатура - позиция номенклатуры
//
// Возвращаемое значение:
//  Структура - Количество, Сумма
//
Функция ОстатокТовара(Склад, Номенклатура)

	Запрос = Новый Запрос(
		"ВЫБРАТЬ
		|	ЕСТЬNULL(СУММА(Остатки.КоличествоОстаток), 0) КАК Количество,
		|	ЕСТЬNULL(СУММА(Остатки.СуммаОстаток), 0) КАК Сумма
		|ИЗ
		|	РегистрНакопления.ТоварыВНаличии.Остатки(, МестоХранения = &Склад И Номенклатура = &Номенклатура) КАК Остатки");
	Запрос.УстановитьПараметр("Склад", Склад);
	Запрос.УстановитьПараметр("Номенклатура", Номенклатура);
	Возврат ПерваяСтрока(Запрос, "Количество, Сумма");

КонецФункции

// Остаток сырья у переработчика: количество и себестоимость.
//
// Параметры:
//  Контрагент   - СправочникСсылка.Контрагенты - контрагент
//  Номенклатура - СправочникСсылка.Номенклатура - позиция номенклатуры
//
// Возвращаемое значение:
//  Структура - Количество, Сумма
//
Функция ОстатокВПереработке(Контрагент, Номенклатура)

	Запрос = Новый Запрос(
		"ВЫБРАТЬ
		|	ЕСТЬNULL(СУММА(Остатки.КоличествоОстаток), 0) КАК Количество,
		|	ЕСТЬNULL(СУММА(Остатки.СуммаОстаток), 0) КАК Сумма
		|ИЗ
		|	РегистрНакопления.ТоварыВПереработке.Остатки(, Контрагент = &Контрагент И Номенклатура = &Номенклатура) КАК Остатки");
	Запрос.УстановитьПараметр("Контрагент", Контрагент);
	Запрос.УстановитьПараметр("Номенклатура", Номенклатура);
	Возврат ПерваяСтрока(Запрос, "Количество, Сумма");

КонецФункции

// Остаток регистра взаиморасчётов по объекту расчётов.
//
// Параметры:
//  ИмяРегистра    - Строка - имя регистра взаиморасчётов
//  ОбъектРасчетов - ДокументСсылка - документ расчётов
//
// Возвращаемое значение:
//  Число - остаток регистра
//
Функция ОстатокВзаиморасчетов(ИмяРегистра, ОбъектРасчетов)

	// Регистры покупателей и поставщиков устроены одинаково: текст пишется по одному,
	// имя второго подставляется.
	ТекстЗапроса =
		"ВЫБРАТЬ
		|	ЕСТЬNULL(СУММА(Остатки.СуммаОстаток), 0) КАК Сумма
		|ИЗ
		|	РегистрНакопления.ВзаиморасчётыСПокупателями.Остатки(, ОбъектРасчётов = &ОбъектРасчетов) КАК Остатки";
	Запрос = Новый Запрос(СтрЗаменить(ТекстЗапроса, "ВзаиморасчётыСПокупателями", ИмяРегистра));
	Запрос.УстановитьПараметр("ОбъектРасчетов", ОбъектРасчетов);
	Возврат ПерваяСтрока(Запрос, "Сумма").Сумма;

КонецФункции

// Остаток денег в кассе или на банковском счёте организации.
//
// Параметры:
//  МестоХранения - СправочникСсылка.Кассы, СправочникСсылка.БанковскиеСчета - касса или счёт
//
// Возвращаемое значение:
//  Число - остаток денег
//
Функция ОстатокДенег(МестоХранения)

	Запрос = Новый Запрос(
		"ВЫБРАТЬ
		|	ЕСТЬNULL(СУММА(Остатки.СуммаОстаток), 0) КАК Сумма
		|ИЗ
		|	РегистрНакопления.ДенежныеСредстваОрганизаций.Остатки(, МестоХранения = &МестоХранения) КАК Остатки");
	Запрос.УстановитьПараметр("МестоХранения", МестоХранения);
	Возврат ПерваяСтрока(Запрос, "Сумма").Сумма;

КонецФункции

// Обороты регистра продаж по документу продажи: количество, выручка, себестоимость.
//
// Параметры:
//  ДокументПродажи - ДокументСсылка.РеализацияТоваровУслуг - документ продажи
//
// Возвращаемое значение:
//  Структура - Количество, Выручка, Себестоимость
//
Функция ОборотыПродаж(ДокументПродажи)

	Запрос = Новый Запрос(
		"ВЫБРАТЬ
		|	ЕСТЬNULL(СУММА(Обороты.КоличествоОборот), 0) КАК Количество,
		|	ЕСТЬNULL(СУММА(Обороты.ВыручкаОборот), 0) КАК Выручка,
		|	ЕСТЬNULL(СУММА(Обороты.СебестоимостьОборот), 0) КАК Себестоимость
		|ИЗ
		|	РегистрНакопления.Продажи.Обороты(, , , ДокументПродажи = &ДокументПродажи) КАК Обороты");
	Запрос.УстановитьПараметр("ДокументПродажи", ДокументПродажи);
	Возврат ПерваяСтрока(Запрос, "Количество, Выручка, Себестоимость");

КонецФункции

// Остаток регистра зарплаты по сотруднику.
//
// Параметры:
//  Сотрудник - СправочникСсылка.ФизическиеЛица - сотрудник
//
// Возвращаемое значение:
//  Число - остаток по сотруднику
//
Функция ОстатокЗарплаты(Сотрудник)

	Запрос = Новый Запрос(
		"ВЫБРАТЬ
		|	ЕСТЬNULL(СУММА(Остатки.СуммаОстаток), 0) КАК Сумма
		|ИЗ
		|	РегистрНакопления.Зарплата.Остатки(, Сотрудник = &Сотрудник) КАК Остатки");
	Запрос.УстановитьПараметр("Сотрудник", Сотрудник);
	Возврат ПерваяСтрока(Запрос, "Сумма").Сумма;

КонецФункции

// Первая строка результата запроса структурой с указанными полями (агрегатный запрос
// без группировки возвращает ровно одну строку).
//
// Параметры:
//  Запрос - Запрос - подготовленный запрос с параметрами
//  Поля   - Строка - имена полей результата через запятую
//
// Возвращаемое значение:
//  Структура - значения полей первой строки; нули, если строк нет
//
Функция ПерваяСтрока(Запрос, Поля)

	Выборка = Запрос.Выполнить().Выбрать();
	Результат = Новый Структура(Поля);
	Если Выборка.Следующий() Тогда
		ЗаполнитьЗначенияСвойств(Результат, Выборка);
	Иначе
		Для Каждого Поле Из Результат Цикл
			Результат[Поле.Ключ] = 0;
		КонецЦикла;
	КонецЕсли;
	Возврат Результат;

КонецФункции

#КонецОбласти

#КонецОбласти
